int/resources/objectRepo/xmlTemplates/ows/OWSProfileService/req_InsertPhone.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:com="http://webservices.micros.com/og/4.3/Common/" xmlns:core="http://webservices.micros.com/og/4.3/Core/" xmlns:name="http://webservices.micros.com/ows/5.1/Name.wsdl">
   <soapenv:Header>
      <core:OGHeader authToken="?" channelValidation="true" primaryLangID="E" terminalID="?" timeStamp="?" transactionID="?">
         <core:Origin entityID="?" organizationID="?" systemType="?"/>
         <core:Destination entityID="?" organizationID="?" systemType="?"/>
         <core:Intermediaries>
            <core:EndPoint entityID="?" organizationID="?" systemType="?"/>
         </core:Intermediaries>
         <core:Authentication>
            <core:UserCredentials>
               <core:UserName/>
               <core:UserPassword/>
               <core:Domain/>
               <core:SecurityId/>
            </core:UserCredentials>
            <core:Licence>
               <core:Key/>
            </core:Licence>
         </core:Authentication>
      </core:OGHeader>
   </soapenv:Header>
   <soapenv:Body>
      <name:InsertPhoneRequest>
         <name:NameID source="?" type="?"/>
         <name:NamePhone displaySequence="?" externalId="?" inactiveDate="?" insertDate="?" insertUser="?" operaId="?" phoneRole="?" phoneType="?" primary="?" primaryPhone="?" updateDate="?" updateUser="?">
            <com:PhoneNumber/>
            <com:PhoneData areaCode="?" countryAccessCode="?" extension="?" phoneNumber="?"/>
         </name:NamePhone>
      </name:InsertPhoneRequest>
   </soapenv:Body>
</soapenv:Envelope>